benchmark_results_replicated/20260423_101844/analysis/rep28/run/go_c400/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    93.21ms   79.22ms 809.07ms   53.24%
    Req/Sec     1.22k   190.39     1.80k    67.28%
  Latency Distribution
     50%   96.18ms
     75%  112.73ms
     90%  198.79ms
     99%  323.52ms
  290658 requests in 1.00m, 35.48MB read
Requests/sec:   4841.95
Transfer/sec:    605.24KB
P95: 217037
P99: 323516